//Гурсовая ГРАФИКА
//Принято, что рабочее пространство 1366*768
//Т.З.
/*
Тема курсовой работы: «Элементарные преобразования трехмерных объектов с удалением невидимых линий и поверхностей и построением теней от заданного источника света»
Множество многогранников пространственной сцены - Два параллелепипеда
Алгоритм закраски - Заливка области с затравкой 
Алгоритм удаления невидимых линий и поверхносте, Алгоритм построения тени  - Совмещенная процедура удаления невидимых поверхностей и построения теней 
*/

#include"ControllerOfParall.h"

int main()
{
	ControllerOfParall obg;

	return obg.menu();
}